#+TITLE:Practice: C Programming Toolchain
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:Linux and GCC basics
#+STARTUP:overview hideblocks
#+OPTIONS: toc:1 ^:nil
* Listing files

  * The command ~ls~ lists all files in the current directory

  * ~ls~ also works with file paths, e.g. this listing of the directory
    ~$HOME~:

    #+begin_src bash :results output
      ls /home/pi
    #+end_src

    #+RESULTS:
    #+begin_example
    bin
    Bookshelf
    csvkit_tutorial
    Desktop
    Documents
    Downloads
    GitHub
    Music
    Pictures
    Public
    src
    Templates
    test
    Videos
    #+end_example

  * [ ] This command has many useful options: try them yourself

    | COMMAND | LISTING           | WHAT?                                   |
    |---------+-------------------+-----------------------------------------|
    | ls -l   | long listing      | file owners, size, time, permissions    |
    | ls -a   | with hidden files | includes configuration files            |
    | ls -t   | time-ordered      | files sort by time of modification      |

  * The example output for ~ls -l~ shows one file called ~README.org~ with
    permissions for the owner (~pi~) and his group (also called ~pi~) of
    size 6832 byte, last saved on May 14 at 18:38.

    #+begin_example
    -rw-r--r-- 1 pi pi 6382 May 14 18:38 README.org
    #+end_example

